---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentRefcolumnEnd
source: html/6fe1eba4-6e10-9733-ff3b-4f5f06efa9d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentRefcolumnEnd Property

"Start of Attachment to Reference Column"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamStartAttachmentRefcolumnEnd { get; }
```